# Выведите столбец чисел от 1 до 100, используя цикл while

num = 0
while num < 100:
    num += 1
    print(num)
