# задача 1
# Дано число num(значение задаете сами). Напечатать “num>0”, если число больше 0, иначе - “num<0”
#
print("Введите число:")
num = float(input())
if num > 0:
    print("num > 0")
else:
    print("num < 0")
